const mongoose = require("mongoose")

const bookSchema = new mongoose.Schema(
    {
        bookname :{
         type :   String,
        required : [true , "Book Title is required"]

        } ,
   

    authorname:{
         type :   String,
        required : [true , "Author Name is required"],
       

        } ,

   price :{
         type :   String,
        required : [true , "Book price is required"]

        } ,

        category : {
           type : String,
           required : [true , "Book category is required"]

        }
    },
    {timestamps : true}
)

module.exports = mongoose.model("Book" , bookSchema)

// model means

// ચાલો, હજુ એક સાવ સીધા અને પ્રેક્ટિકલ ઉદાહરણથી સમજીએ. 
// કલ્પના કરો કે તમે એક સરકારી ઑફિસ (ડેટાબેઝ) માં જાઓ છો.
// ત્યાં તમારે નવું આધાર કાર્ડ કઢાવવું છે.
// 1. Schema (સ્કીમા) એટલે ફોર્મની ડિઝાઇન 📝તમે ઑફિસમાં ગયા એટલે તમને એક 
// ખાલી ફોર્મ આપ્યું. એ ફોર્મ પર લખેલું છે:
// નામ (String, ફરજિયાત)ઈમેલ (String, ફરજિયાત)પાસવર્ડ (String, ફરજિયાત)
// આ ખાલી ફોર્મ એ પોતે કોઈ માણસ નથી, 
// એ કોઈ ડેટા નથી. એ ખાલી એક નિયમ છે કે જો તમારે આધાર કાર્ડ કઢાવવું હોય 
// તો આટલી વિગત આપવી જ પડશે. તમારા કોડમાં આ userSchema છે.2. 
// Model (મોડેલ) એટલે ત્યાં બેઠેલો કમ્પ્યુટર ઓપરેટર/સરકારી બાબુ 
// 👨‍💻હવે તમે ફોર્મ ભરી લીધું. 
// પણ જો તમે એ ફોર્મ ટેબલ પર મૂકીને ચાલ્યા જશો, 
// તો શું તમારો ડેટા કમ્પ્યુટરમાં સેવ થઈ જશે? 
// ના.તમારે એ ફોર્મ ત્યાં બેઠેલા ઓપરેટર (બાબુ) ને આપવું પડશે.એ ઓપરેટર તમારું ફોર્મ ચેક કરશે 

// કે બધું સાચું ભર્યું છે ને? (validation)એ ઓપરેટર કમ્પ્યુટરમાં ટાઈપ કરીને તમારો ડેટા સરકારી સર્વર (MongoDB ડેટાબેઝ) 
// માં સેવ કરશે.ભવિષ્યમાં જો તમારે તમારું આધાર કાર્ડ ખોવાઈ જાય અને શોધવું હોય, 
// તો તમે એ જ ઓપરેટર પાસે જશો અને એ તમને કમ્પ્યુટરમાંથી શોધી આપશે.
// તમારા કોડમાં આ ઑપરેટર એટલે મોડેલ (Model).